### Importing the necessary libraries

In [735]:
import pandas as pd
import numpy as np
import random

### Reading the data.

In [736]:
DirtyData = pd.read_csv("Income Dirty Data.csv")

In [737]:
DirtyData

       ID  gender  age    income  tax (15%)
0       1   Women   21 147168.00   22075.20
1       2  Female   29 119595.00   17939.25
2       3  Female   56  87770.00   13165.50
3       4     NaN   21  54259.00    8138.85
4       5    Male   28       NaN  160230.00
..    ...     ...  ...       ...        ...
995   996  Female   36       NaN   14623.80
996   997  Female    0       NaN   19976.25
997   998  Female   59  96847.00   14527.05
998   999     Man   38 108257.00   16238.55
999  1000    Male   49  70424.00   10563.60

[1000 rows x 5 columns]

In [738]:
DirtyData = DirtyData[["gender", "age", "income", "tax (15%)"]]

In [739]:
DirtyData

     gender  age    income  tax (15%)
0     Women   21 147168.00   22075.20
1    Female   29 119595.00   17939.25
2    Female   56  87770.00   13165.50
3       NaN   21  54259.00    8138.85
4      Male   28       NaN  160230.00
..      ...  ...       ...        ...
995  Female   36       NaN   14623.80
996  Female    0       NaN   19976.25
997  Female   59  96847.00   14527.05
998     Man   38 108257.00   16238.55
999    Male   49  70424.00   10563.60

[1000 rows x 4 columns]

In [740]:
TotalMissing = DirtyData.isna().sum()

In [741]:
TotalMissing

gender        88
age            0
income       109
tax (15%)     93
dtype: int64

####  Count total observations

In [742]:
total_observations = DirtyData.shape[0]

In [743]:
total_observations

1000

#### Count complete observations (rows with no missing values)

In [744]:
complete_observations = DirtyData.dropna().shape[0]

In [745]:
complete_observations

733

#### Calculate percentage of complete observations

In [746]:
percentage_complete = (complete_observations / total_observations) * 100

In [747]:
print(f"Number of complete observations: {complete_observations}")
print(f"Percentage of complete observations: {percentage_complete:.2f}%")

Number of complete observations: 733
Percentage of complete observations: 73.30%

### Checking with Rules

In [748]:
validRows = len(DirtyData[(DirtyData['age'] > 18) & (DirtyData['income'] > 0) & (DirtyData['tax (15%)'] == DirtyData['income']*.15)])
print(validRows)

452

In [749]:
valid_percentage = validRows/len(DirtyData)
print(f"Percentage of data with no errors: {valid_percentage:.2f}%")

Percentage of data with no errors: 0.45%

### Making the corrections

#### Replacing non-Female/Male values from Gender attribute to either Male or Female

In [750]:
gender = DirtyData["gender"].unique()

In [751]:
gender

array(['Women', 'Female', nan, 'Male', 'Woman', 'Man', 'Men'],
      dtype=object)

In [752]:
# We can use a mapping dictionary for gender values
gender_mapping = {
    "Man": "Male",
    "Men": "Male",
    "Woman": "Female",
    "Women": "Female"
}

In [753]:
# then we replace the incorrect values
DirtyData.loc[:, "gender"] = DirtyData["gender"].replace(gender_mapping)

In [754]:
# then the NaN values with a random choice of Male or Female
DirtyData.loc[:, "gender"] = DirtyData["gender"].apply(lambda x: np.random.choice(["Male", "Female"]) if pd.isna(x) else x)

In [755]:
print(DirtyData["gender"].unique())

['Female' 'Male']

#### The Age column

In [756]:
age = DirtyData[DirtyData["age"] < 0]

In [757]:
age

     gender  age    income  tax (15%)
6    Female   -1       NaN        NaN
19   Female   -1  89991.00        NaN
22     Male   -1   -727.00   22500.00
32     Male   -1       NaN   19040.25
77   Female   -1 123810.00   18571.50
114  Female   -1 142098.00   21314.70
159  Female   -1 104625.00   15693.75
160    Male   -1 113039.00   16955.85
163  Female   -1 124471.00   18670.65
165  Female   -1 120228.00   18034.20
167  Female   -1  89626.00   13443.90
170    Male   -1  91679.00   13751.85
202    Male   -1  59793.00        NaN
210    Male   -1  83320.00   12498.00
235    Male   -1  69039.00   10355.85
256  Female   -1 131232.00   19684.80
287  Female   -1       NaN   15795.00
297  Female   -1  80470.00   12070.50
306  Female   -1 109490.00        NaN
310    Male   -1 112247.00   16837.05
329    Male   -1  60954.00    9143.10
386  Female   -1  74949.00   11242.35
412  Female   -1 146800.00   22020.00
423    Male   -1  93233.00   13984.95
437    Male   -1 113015.00   16952.25
474    Male   -1 148166.00   22224.90
475  Female   -1 144221.00        NaN
559    Male   -1 122099.00   18314.85
583  Female   -1 126674.00   19001.10
598  Female   -1  83111.00   12466.65
603  Female   -1  86309.00   12946.35
666    Male   -1 142426.00   21363.90
681  Female   -1  89254.00   13388.10
685  Female   -1       NaN   11202.00
703  Female   -1 124718.00   18707.70
711  Female   -1  83338.00   12500.70
717    Male   -1  88106.00   13215.90
742  Female   -1 137813.00   20671.95
753    Male   -1   -286.00    9722.85
777  Female   -1  81222.00  324888.00
793  Female   -1 136937.00   20540.55
804  Female   -1  55438.00    8315.70
858  Female   -1  52680.00  263400.00
870  Female   -1  62841.00    9426.15
884    Male   -1 138120.00        NaN
885    Male   -1 110145.00   16521.75
899    Male   -1  82256.00   12338.40
960  Female   -1  96996.00   14549.40
985    Male   -1 137542.00   20631.30
989  Female   -1   -742.00   15213.75
990  Female   -1 129947.00   19492.05

In [758]:
DirtyData.loc[DirtyData['age'] <= 0, 'age'] = np.NaN

In [759]:
age = DirtyData[DirtyData["age"] < 0]
age

Empty DataFrame
Columns: [gender, age, income, tax (15%)]
Index: []

#### Replacing non-positive income values with NA (Optional: derive from Tax if possible)

In [760]:
# i want to see where income and the taxes have na's in them
print(DirtyData[DirtyData[["income"]].isna().all(axis=1)])

     gender   age  income  tax (15%)
4      Male 28.00     NaN  160230.00
6    Female   NaN     NaN        NaN
7    Female 24.00     NaN   11820.60
11     Male 55.00     NaN    9776.25
28   Female 43.00     NaN   16849.95
..      ...   ...     ...        ...
963  Female 30.00     NaN   19216.50
971    Male 22.00     NaN   14752.95
991    Male 35.00     NaN   21350.55
995  Female 36.00     NaN   14623.80
996  Female   NaN     NaN   19976.25

[109 rows x 4 columns]

In [761]:
income = DirtyData["income"] <= 0
income.sum()

44

In [762]:
# I am going to replace the non positives ones with NA
DirtyData.loc[~(DirtyData['income'] > 0), 'income'] = np.NaN

In [763]:
income = DirtyData["income"] <= 0
income.sum()

0

In [764]:
# i want to see where income have na's in them
print(DirtyData[DirtyData[["income"]].isna().all(axis=1)])

     gender   age  income  tax (15%)
4      Male 28.00     NaN  160230.00
6    Female   NaN     NaN        NaN
7    Female 24.00     NaN   11820.60
11     Male 55.00     NaN    9776.25
22     Male   NaN     NaN   22500.00
..      ...   ...     ...        ...
971    Male 22.00     NaN   14752.95
989  Female   NaN     NaN   15213.75
991    Male 35.00     NaN   21350.55
995  Female 36.00     NaN   14623.80
996  Female   NaN     NaN   19976.25

[153 rows x 4 columns]

In [765]:
# so i am going to derive income values from the tax columns 
DirtyData.loc[:, "income"] = DirtyData.apply(
    lambda row: row["tax (15%)"] / 0.15 if pd.notnull(row["tax (15%)"]) and pd.isnull(row["income"]) else row["income"], 
    axis=1
)

In [766]:
# i want to see where income have na's in them
print(DirtyData[DirtyData[["income"]].isna().all(axis=1)])

     gender   age  income  tax (15%)
6    Female   NaN     NaN        NaN
42     Male 24.00     NaN        NaN
97     Male 43.00     NaN        NaN
304  Female 27.00     NaN        NaN
360    Male 37.00     NaN        NaN
480    Male 24.00     NaN        NaN
537    Male 22.00     NaN        NaN
653  Female 42.00     NaN        NaN
680    Male 40.00     NaN        NaN
932    Male 22.00     NaN        NaN

In [767]:
income = DirtyData[DirtyData["income"] <= 0]
print(income)

     gender   age    income  tax (15%)
82   Female 59.00      0.00       0.00
164    Male 30.00      0.00       0.00
396  Female 23.00 -15466.67   -2320.00
481    Male 50.00 -47460.00   -7119.00
951    Male 41.00  -5760.00    -864.00

##### there are still some non-positive income values, the reason is because the tax column i was meant to generate them from had either 0 as values, or negatives.

In [768]:
# I am going to replace the non positives ones with NA again
DirtyData.loc[~(DirtyData['income'] > 0), 'income'] = np.NaN

In [769]:
income = DirtyData[DirtyData["income"] <= 0]
print(income)

Empty DataFrame
Columns: [gender, age, income, tax (15%)]
Index: []

##### now there aren't any negatives or zero values anymore. Just NA's

#### Replacing erroneous Tax values with NA (Optional: derive from Income if possible)

In [770]:
tax = DirtyData["tax (15%)"] <= 0
tax.sum()

10

In [771]:
print(DirtyData[DirtyData["tax (15%)"] <= 0])

     gender   age    income  tax (15%)
82   Female 59.00       NaN       0.00
164    Male 30.00       NaN       0.00
396  Female 23.00       NaN   -2320.00
481    Male 50.00       NaN   -7119.00
591  Female 23.00  53717.00       0.00
861    Male   NaN  82603.00       0.00
867  Female 60.00  52355.00       0.00
898  Female   NaN 127438.00       0.00
939  Female 27.00  61374.00       0.00
951    Male 41.00       NaN    -864.00

In [772]:
DirtyData.loc[~(DirtyData['tax (15%)'] > 0), 'tax (15%)'] = np.NaN

##### the tax column has some negative values, but some cannot be derived from the income column because even the income column has NAs

In [773]:
tax = DirtyData["tax (15%)"] <= 0
tax.sum()

0

In [774]:
DirtyData.loc[:, 'tax (15%)'] = np.where(
    (DirtyData['income'].notnull()) & (DirtyData['tax (15%)'].isnull()),
    DirtyData['income'] * 0.15,
    DirtyData['tax (15%)']
)

In [775]:
# i want to see where income and the taxes have na's in them
print(DirtyData[DirtyData[['tax (15%)']].isna().all(axis=1)])

     gender   age  income  tax (15%)
6    Female   NaN     NaN        NaN
42     Male 24.00     NaN        NaN
82   Female 59.00     NaN        NaN
97     Male 43.00     NaN        NaN
164    Male 30.00     NaN        NaN
304  Female 27.00     NaN        NaN
360    Male 37.00     NaN        NaN
396  Female 23.00     NaN        NaN
480    Male 24.00     NaN        NaN
481    Male 50.00     NaN        NaN
537    Male 22.00     NaN        NaN
653  Female 42.00     NaN        NaN
680    Male 40.00     NaN        NaN
932    Male 22.00     NaN        NaN
951    Male 41.00     NaN        NaN

In [776]:
# i want to see where income and the taxes have na's in them
print(DirtyData[DirtyData[['income', 'tax (15%)']].isna().all(axis=1)])

     gender   age  income  tax (15%)
6    Female   NaN     NaN        NaN
42     Male 24.00     NaN        NaN
82   Female 59.00     NaN        NaN
97     Male 43.00     NaN        NaN
164    Male 30.00     NaN        NaN
304  Female 27.00     NaN        NaN
360    Male 37.00     NaN        NaN
396  Female 23.00     NaN        NaN
480    Male 24.00     NaN        NaN
481    Male 50.00     NaN        NaN
537    Male 22.00     NaN        NaN
653  Female 42.00     NaN        NaN
680    Male 40.00     NaN        NaN
932    Male 22.00     NaN        NaN
951    Male 41.00     NaN        NaN

In [777]:
DirtyData

     gender   age     income  tax (15%)
0    Female 21.00  147168.00   22075.20
1    Female 29.00  119595.00   17939.25
2    Female 56.00   87770.00   13165.50
3    Female 21.00   54259.00    8138.85
4      Male 28.00 1068200.00  160230.00
..      ...   ...        ...        ...
995  Female 36.00   97492.00   14623.80
996  Female   NaN  133175.00   19976.25
997  Female 59.00   96847.00   14527.05
998    Male 38.00  108257.00   16238.55
999    Male 49.00   70424.00   10563.60

[1000 rows x 4 columns]

### Imputing

In [778]:
pd.set_option('display.float_format', '{:.4f}'.format)

In [779]:
DirtyData.describe()

           age       income    tax (15%)
count 902.0000     985.0000     985.0000
mean   38.9645  111995.3411   52111.7252
std    12.6253  210949.0544  156904.0115
min    18.0000      70.0000      10.5000
25%    28.0000   70634.0000   11173.2000
50%    40.0000   97838.0000   15849.6000
75%    50.0000  124674.0000   19722.7500
max    60.0000 5200320.0000 1362450.0000

In [780]:
# i want to print it in such a way that i can see the NA's alongside the five number summary. 

summary = DirtyData.describe().loc[["min", "25%", "50%", "mean", "75%", "max"]]
summary.loc["NA's"] = DirtyData.isna().sum()
print(summary)

         age       income    tax (15%)
min  18.0000      70.0000      10.5000
25%  28.0000   70634.0000   11173.2000
50%  40.0000   97838.0000   15849.6000
mean 38.9645  111995.3411   52111.7252
75%  50.0000  124674.0000   19722.7500
max  60.0000 5200320.0000 1362450.0000
NA's 98.0000      15.0000      15.0000

#### KNN Imputation

In [781]:
from sklearn import preprocessing
from sklearn.impute import KNNImputer
from sklearn.preprocessing import LabelEncoder

In [782]:
# Encoding the gender column (Male, Female) to (0,1)
le = preprocessing.LabelEncoder()
DirtyData.loc[:, "gender"] = le.fit_transform(DirtyData["gender"]).astype(int)

In [783]:
scaler = preprocessing.StandardScaler()

# Define features correctly as a list of column names
features = ['gender', 'age', 'income', 'tax (15%)']
# Use .loc to avoid SettingWithCopyWarning
DirtyData.loc[:, features] = scaler.fit_transform(DirtyData[features])

In [784]:
summary = DirtyData.describe().loc[["min", "25%", "50%", "mean", "75%", "max"]]
summary.loc["NA's"] = DirtyData.isna().sum()
print(summary)

         age  income  tax (15%)
min  -1.6614 -0.5308    -0.3322
25%  -0.8689 -0.1962    -0.2610
50%   0.0821 -0.0671    -0.2312
mean  0.0000  0.0000    -0.0000
75%   0.8746  0.0601    -0.2065
max   1.6671 24.1334     8.3555
NA's 98.0000 15.0000    15.0000

In [785]:
imputer = KNNImputer()
filledDirtyData = imputer.fit_transform(DirtyData)

In [786]:
id_col = list(range(1,1001))
cols = ['gender', 'age', 'income', 'tax (15%)']
FinalData = pd.DataFrame(data=filledDirtyData, columns=cols)
FinalData.index.name = "ID"

In [787]:
FinalData

     gender     age  income  tax (15%)
ID
0   -0.9861 -1.4237  0.1668    -0.1915
1   -0.9861 -0.7897  0.0360    -0.2179
2   -0.9861  1.3501 -0.1149    -0.2483
3   -0.9861 -1.4237 -0.2738    -0.2804
4    1.0141 -0.8689  4.5352     0.6894
..      ...     ...     ...        ...
995 -0.9861 -0.2349 -0.0688    -0.2390
996 -0.9861  0.2247  0.1005    -0.2049
997 -0.9861  1.5878 -0.0718    -0.2397
998  1.0141 -0.0764 -0.0177    -0.2287
999  1.0141  0.7953 -0.1972    -0.2649

[1000 rows x 4 columns]

In [788]:
summary = FinalData.describe().loc[["min", "25%", "50%", "mean", "75%", "max"]]
summary.loc["NA's"] = FinalData.isna().sum()
print(summary)

      gender     age  income  tax (15%)
min  -0.9861 -1.6614 -0.5308    -0.3322
25%  -0.9861 -0.7897 -0.1950    -0.2606
50%  -0.9861 -0.0130 -0.0659    -0.2308
mean  0.0000 -0.0150  0.0040     0.0029
75%   1.0141  0.7953  0.0602    -0.2055
max   1.0141  1.6671 24.1334     8.3555
NA's  0.0000  0.0000  0.0000     0.0000